app/controllers/aceita_reservas_controller.rb

    def create
        @reserva_aceitum = ReservaAceitum.new()
        @reserva_aceitum.quadra = @quadra.name
        @reserva_aceitum.inicio = @reserva.inicio
        @reserva_aceitum.fim = @reserva.termino
        @reserva.status = 1
        @reserva.save
---
UPDATE "reservas" SET "status" = ?, "updated_at" = ? WHERE "reservas"."id" = ?  [["status", 1], ["updated_at", "2019-11-25 17:41:13.386772"], ["id", 1]]