app/controllers/aceita_reservas_controller.rb

    def show
        @quadraHash = {101 => 'Quadra 1', 102 => 'Quadra 2', 103=> 'Quadra 3', 104 => 'Quadra 4', 105 => 'Quadra 5', 106 => 'Quadra 6', 107 => 'Quadra 7', 108 => 'Quadra 8', 109 => 'Quadra 9 A', 110 => 'Quadra 9 B', 111 => 'Quadra 10 A', 112 => 'Quadra 10 B', 113 => 'Velódromo A', 114 => 'Velódromo B', 115 => 'Módulo 1', 116 => 'Módulo 2', 117 => 'Módulo 3', 118 => 'Módulo 4'  }
        @diasHash = {1 => 'Segunda',2 => 'Terça',3 => 'Quarta', 4 => 'Quinta', 5 => 'Sexta'}

        @parametroQuadra = params[:id].to_i/10
        @resposta1 = @quadraHash[params[:id].to_i / 10]
        puts @diasHash[params[:id].to_i%10]
        @resposta2 = @diasHash[params[:id].to_i%10]
        @quadra = Quadra.find_by name: @resposta1
        lista_undesirables = []
        @reservas = Reserva.where(status:0).where(dia: @resposta2)
        @reservas.each do |reserva|
---
SELECT "quadras".* FROM "quadras" WHERE "quadras"."name" = ? LIMIT ?  [["name", "Quadra 1"], ["LIMIT", 1]]
SELECT "reservas".* FROM "reservas" WHERE "reservas"."status" = ? AND "reservas"."dia" = ? AND 1=1 AND 1=1 AND 1=1  [["status", 0], ["dia", "Segunda"]]
SELECT "reservas".* FROM "reservas" WHERE "reservas"."status" = ? AND "reservas"."dia" = ?  [["status", 0], ["dia", "Segunda"]]

    def new
        @reserva_aceitum = ReservaAceitum.new
        @url = '/aprovar/' + params[:id].to_s
        @reserva = Reserva.find(params[:id].to_i/1000)
---
SELECT "reservas".* FROM "reservas" WHERE "reservas"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

    def create
        @reserva = Reserva.find(params[:id].to_i/1000)
        @quadraHash = {101 => 'Quadra 1', 102 => 'Quadra 2', 103=> 'Quadra 3', 104 => 'Quadra 4', 105 => 'Quadra 5', 106 => 'Quadra 6', 107 => 'Quadra 7', 108 => 'Quadra 8', 109 => 'Quadra 9 A', 110 => 'Quadra 9 B', 111 => 'Quadra 10 A', 112 => 'Quadra 10 B', 113 => 'Velódromo A', 114 => 'Velódromo B', 115 => 'Módulo 1', 116 => 'Módulo 2', 117 => 'Módulo 3', 118 => 'Módulo 4'  }
        @quadra =  @quadraHash[params[:id].to_i%1000]
        @quadraParaMudanca = Quadra.where(name: @quadra).take
---
SELECT "reservas".* FROM "reservas" WHERE "reservas"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "quadras".* FROM "quadras" WHERE "quadras"."name" = ? LIMIT ?  [["name", "Quadra 9 B"], ["LIMIT", 1]]

            @quadraParaMudanca.sex[resultado+1] = @reserva_aceitum.dono+'-'+@reserva_aceitum.esporte[0]+@reserva_aceitum.naipe[0]

        end
        @quadraParaMudanca.save
        @reserva.save
---
UPDATE "quadras" SET "sex" = ?, "updated_at" = ? WHERE "quadras"."id" = ?  [["sex", "---\n- Vago\n- Vago\n- Vago\n- Vago\n- Vago\n- LuAAAna-FM\n- LuAAAna-FM\n- LuAAAna-FM\n- Vago\n"], ["updated_at", "2019-11-25 18:40:29.985200"], ["id", 49]]
UPDATE "reservas" SET "status" = ?, "updated_at" = ? WHERE "reservas"."id" = ?  [["status", 1], ["updated_at", "2019-11-25 18:26:38.956157"], ["id", 5]]

    def set_coisas
        @reserva = Reserva.find(params[:id].to_i/1000)
---
SELECT "reservas".* FROM "reservas" WHERE "reservas"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def reiniciarQuadra
        @quadras = Quadra.all
        @quadras.each do |quadra|
            quadra.seg = ['Vago','Vago','Vago','Vago','Vago','Vago','Vago','Vago','Vago']
            quadra.ter = ['Vago','Vago','Vago','Vago','Vago','Vago','Vago','Vago','Vago']
            quadra.qua = ['Vago','Vago','Vago','Vago','Vago','Vago','Vago','Vago','Vago']
            quadra.qui = ['Vago','Vago','Vago','Vago','Vago','Vago','Vago','Vago','Vago']
            quadra.sex = ['Vago','Vago','Vago','Vago','Vago','Vago','Vago','Vago','Vago']
            quadra.save
        end
        @reservas = Reserva.all
        @reservas.each do |reserva|
            reserva.status = 0
            reserva.save
---
SELECT "quadras".* FROM "quadras"
UPDATE "quadras" SET "seg" = ?, "updated_at" = ? WHERE "quadras"."id" = ?  [["seg", "---\n- Vago\n- Vago\n- Vago\n- Vago\n- Vago\n- Vago\n- Vago\n- Vago\n- Vago\n"], ["updated_at", "2019-11-25 18:37:19.519280"], ["id", 39]]
SELECT "reservas".* FROM "reservas"
UPDATE "reservas" SET "status" = ?, "updated_at" = ? WHERE "reservas"."id" = ?  [["status", 0], ["updated_at", "2019-11-25 18:45:08.316411"], ["id", 1]]