app/controllers/aceita_reservas_controller.rb

    def index
        @reservas = Reserva.all
---
SELECT "reservas".* FROM "reservas" LIMIT ?  [["LIMIT", 1]]