app/controllers/atleticas_controller.rb

  def index
    @atleticas = Atletica.all
---
SELECT "atleticas".* FROM "atleticas"

  def create
    @atletica = Atletica.new(atletica_params)

    respond_to do |format|
      if @atletica.save
---
INSERT INTO "atleticas" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "fau"], ["email", "fau@usp.br"], ["password", "fau"], ["created_at", "2019-11-13 13:01:54.990740"], ["updated_at", "2019-11-13 13:01:54.990740"]]

  def update
    respond_to do |format|
      if @atletica.update(atletica_params)
---
UPDATE "atleticas" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "atleticas"."id" = ?  [["name", "LiliAAAn"], ["password_digest", "$2a$12$p.aboutpFWRZ3WfbSnr29.VXBmc1zN7Rmn7JACtJXhbjWY.MC74nG"], ["updated_at", "2019-11-21 18:51:55.659373"], ["id", 2]]

  def destroy
    @atletica.destroy
---
DELETE FROM "atleticas" WHERE "atleticas"."id" = ?  [["id", 1]]

    def set_atletica
      @atletica = Atletica.find(params[:id])
---
SELECT "atleticas".* FROM "atleticas" WHERE "atleticas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]