app/controllers/quadras_controller.rb

    def index
        @quadras = Quadra.all
---
SELECT "quadras".* FROM "quadras"

    def show
        @quadra = Quadra.find(params[:id])
---
SELECT "quadras".* FROM "quadras" WHERE "quadras"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]