app/controllers/reservas_controller.rb

    def set_reserva
      @reserva = Reserva.find(params[:id])
---
SELECT "reservas".* FROM "reservas" WHERE "reservas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]