app/controllers/reservas_controller.rb

SELECT "reservas".* FROM "reservas"
SELECT "reservas".* FROM "reservas" WHERE "reservas"."criador" = ? LIMIT ?  [["criador", "POLI"], ["LIMIT", 1]]
---
  def index
    if current_user.role != 'atletica'
      @reservas = Reserva.all
    else
      @reservas = Reserva.where(criador: current_user.name)

INSERT INTO "reservas" ("modalidade", "naipe", "dia", "inicio", "termino", "odp", "ph", "created_at", "updated_at", "user_id", "criador") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @reserva = Reserva.new(reserva_params)
    @reserva.user_id = current_user.id
    @reserva.criador = current_user.name

    respond_to do |format|
      if @reserva.save

UPDATE "reservas" SET "inicio" = ?, "updated_at" = ? WHERE "reservas"."id" = ?  [["inicio", "2000-01-01 19:00:00"], ["updated_at", "2019-11-23 20:21:27.513824"], ["id", 15]]
---
  def update
    respond_to do |format|
      if @reserva.update(reserva_params)

DELETE FROM "reservas" WHERE "reservas"."id" = ?  [["id", 2]]
---
  def destroy
    @reserva.destroy

DELETE FROM "reservas"
---
  def reset
    Reserva.delete_all

SELECT "reservas".* FROM "reservas" WHERE "reservas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reservas".* FROM "reservas" WHERE "reservas"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_reserva
      @reserva = Reserva.find(params[:id])
      @criador = User.find(@reserva.user_id)