app/controllers/reserva_aceita_controller.rb

SELECT "reservas".* FROM "reservas" WHERE "reservas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_reserva_novo
      @reserva = Reserva.find(params[:id])