app/controllers/solicitacao_pontuals_controller.rb

SELECT "solicitacao_pontuals".* FROM "solicitacao_pontuals"
---
  def index
    @solicitacao_pontuals = SolicitacaoPontual.all

INSERT INTO "solicitacao_pontuals" ("Solicitação", "created_at", "updated_at") VALUES (?, ?, ?)  [["Solicitação", "teste"], ["created_at", "2019-11-25 16:39:23.690829"], ["updated_at", "2019-11-25 16:39:23.690829"]]
---
  def create
    @solicitacao_pontual = SolicitacaoPontual.new(solicitacao_pontual_params)
    UserMailer.reserva_pontual(@solicitacao_pontual).deliver_now

    respond_to do |format|
      if @solicitacao_pontual.save

DELETE FROM "solicitacao_pontuals" WHERE "solicitacao_pontuals"."id" = ?  [["id", 2]]
---
  def destroy
    @solicitacao_pontual.destroy

SELECT "solicitacao_pontuals".* FROM "solicitacao_pontuals" WHERE "solicitacao_pontuals"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_solicitacao_pontual
      @solicitacao_pontual = SolicitacaoPontual.find(params[:id])