app/controllers/tabela_controller.rb

SELECT "quadras".* FROM "quadras" LIMIT ?  [["LIMIT", 1]]
---
    def index
        @quadras = Quadra.all