app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "role") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
        @user = User.new(user_params)
        if @user.save

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "role") VALUES (?, ?, ?, ?, ?, ?)
---
    def criaLaausp
        @user = User.new(name: "LAAUSP", email: "laausp@usp.br", password: "123456", role: :LAAUSP)
        if @user.save